'''
Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. 
Начиная с 1 и 2, первые 10 элементов будут:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.
'''

i = 0
fib = []
sum = 0

while True:
	if i <= 2:
		fib.append(i)

	else:
		fib.append(fib[i - 1] + fib[i - 2])

	if i % 2 == 0:
		sum += fib[i]

	if fib[i] > 4000000:
		break

	i = i + 1

print(str(sum))
